backend/app/Controllers/role/Role.php

INSERT INTO "role" ("nama_role", "deskripsi", "login_destinasi", "created_at", "updated_at") VALUES ('test', 'test', 'test', '2026-05-22 13:40:17', '2026-05-22 13:40:17')
---
  public function store(){
   $data = $this->request->getJSON(true);

   $this->model->insert([
    'nama_role' => $data['nama_role'],
    'deskripsi' => $data['deskripsi'],
    'login_destinasi' => $data['login_destinasi'],
    'created_at' => date('Y-m-d H:i:s'),
    'updated_at' => date('Y-m-d H:i:s'),
   ]);