backend/app/Controllers/User/user.php

    public function update(int $id){
        if(!$this->model->find($id)){
            return $this->respond([
                'error' => $this->model->errors() ? $this->model->errors() : 'Id user tidak ditemukan!',
                'status' => 403,
                'message' => 'Id user tidak ditemukan!'
            ], 403);
        }

        $request = $this->request->getRawInput();

        $dataUpdate = [
            'role_id'  => $request['role_id'] ,
            'siswa_id' => $request['siswa_id'] ?? null,
            'username' => $request['username'],
            'email' => $request['email'],
            'password' => $this->model->hashPassword($request['password']),
            'is_active' => $request['is_active'],
        ];

        if(!$this->model->update($id, $dataUpdate)){
---
UPDATE "user" SET "role_id" = '1', "siswa_id" = NULL, "username" = 'admin', "email" = 'admin12@gmail.com', "password" = '$2y$12$YyCQLO5f/WFtbiKSYm7DOO0oYNKByyA1e5Lo/jKjTaugvbvV33mDa', "is_active" = '1', "updated_at" = '2026-06-06 16:49:54'
WHERE "user"."id" IN (1)